# SetPaletteVisibility

## Description
Sets the visibility state of a palette.

```pascal
PROCEDURE SetPaletteVisibility(
				paletteName : STRING;
				vis         : BOOLEAN);
```

```python

def vs.SetPaletteVisibility(paletteName, vis):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|paletteName|STRING|Name of the palette|
|vis|BOOLEAN|True if the palette should be visible, false otherwise|

## See Also
VS Functions:
GetPaletteVisibility

## Version
Availability: from VectorWorks10.0
## Category
* Utility